export const mockData = [
  {
    id: 1,
    name: 'Механика игры',
    comments: [
      {
        id: 1,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Раз два три',
        date: 'Fri Jun 30 2023 18:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 2,
        user: {
          id: 2,
          userName: 'Андрей',
        },
        text: 'Крутая механика',
        date: 'Fri Jun 30 2023 20:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 3,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Стоило бы сделать оптимизацию',
        date: 'Fri Jun 30 2023 22:11:51 GMT+0300 (Москва, стандартное время)',
      },
    ],
    author: {
      id: 1,
      userName: 'Курбан',
    },
    date: 'Fri Jun 29 2023 18:11:51 GMT+0300 (Москва, стандартное время)',
  },
  {
    id: 2,
    name: 'Лидеры',
    comments: [
      {
        id: 1,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Раз два три',
        date: 'Fri Jun 30 2023 18:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 2,
        user: {
          id: 2,
          userName: 'Андрей',
        },
        text: 'Крутая механика',
        date: 'Fri Jun 30 2023 20:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 3,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Стоило бы сделать оптимизацию',
        date: 'Fri Jun 30 2023 22:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 4,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Раз два три',
        date: 'Fri Jun 30 2023 18:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 5,
        user: {
          id: 2,
          userName: 'Андрей',
        },
        text: 'Крутая механика',
        date: 'Fri Jun 30 2023 20:11:51 GMT+0300 (Москва, стандартное время)',
      },
      {
        id: 6,
        user: {
          id: 1,
          userName: 'Курбан',
        },
        text: 'Стоило бы сделать оптимизацию',
        date: 'Fri Jun 30 2023 22:11:51 GMT+0300 (Москва, стандартное время)',
      },
    ],
    author: {
      id: 2,
      userName: 'Андрей',
    },
    date: 'Fri Jun 20 2023 18:11:51 GMT+0300 (Москва, стандартное время)',
  },
]
